import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

export default new Vuex.Store({
    state: {
        //todos: []
        lngLats:[
            {
                id:6,
                x:121.500542,
                y:31.022268
            },//6
            {
                id:7,
                x:121.504554,
                y:31.036527
            },//7
            {
                id:21,
                x:121.507559,
                y:31.034532
            },//21
            {
                id:22,
                x:121.507555,
                y:31.030769
            },//22
            {
                id:24,
                x:121.50041,
                y:31.030548
            },//24
            {
                id:25,
                x:121.498999,
                y:31.031789
            },//25
            {
                id:26,
                x:121.501397,
                y:31.034887
            },//26
            {
                id:27,
                x:121.503156,
                y:31.035365
            },//27
            {
                id:28,
                x:121.503387,
                y:31.030566
            }//28
        ],
        lines:[
            {
                id:1,
                name:'路线一',
                stations:[6,24,25,26,27,7],//途径过的站点
                lineArr:[
                    [121.500542, 31.022268],//6
                    [121.50013,31.023129],
                    [121.499433,31.025322],
                    [121.501267,31.025616],
                    [121.501278,31.027253],
                    [121.501305,31.030572],
                    [121.50041,31.030548],
                    [121.498988,31.030406],//24
                    [121.498999,31.031789],//25
                    [121.499009,31.032861],
                    [121.498998,31.03378],
                    [121.499025,31.0339],
                    [121.49917,31.034198],
                    [121.49939,31.034345],
                    [121.499878,31.034483],
                    [121.501397,31.034887],//26
                    [121.503156,31.035365],//27
                    [121.50461,31.035784],
                    [121.504554,31.036527]//7
                ]

            },//路线一
            {
                id:2,
                name:'路线二',
                stations:[22,28,24,25,26,27,7],//途径过的站点
            },//路线二
            {
                id:3,
                name:'路线三',
                stations:[6,28,22,21,7],//途径过的站点
            },//路线三
            {
                id:4,
                name:'路线四',
                stations:[22,21,27,26,25,24,28,7],//途径过的站点
            }//路线四
        ]
    },
    getters: {
        // //加工形成新的数据
        // showhistory(state) {
        //     return state.todos.filter(item => item.completed == true);
        // }
    },
    mutations: {
        // addtodo(state, payload) {
        //     if (payload.title == "") {
        //         alert("你输入的内容为空，请重新输入后提交！");
        //     } else {
        //         state.todos.push(payload);
        //     }
        // },
        // is_ok(state, id) {
        //     state.todos.find(item => item.id == id).completed = true;
        // },
        // delete(state, id) {
        //     if (confirm("确定要删除这个任务吗？删除就找不到了！")) {
        //         state.todos = state.todos.filter(item => item.id != id);
        //     } else {
        //         return
        //     }
        //
        // }
    },
    modules: {}
})
